Revit 2027 API
BuiltInFailures.StairRampFailures.NoProfileForRail Property
 Must specify Profiles for every Rail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoProfileForRail { get; }
Public Shared ReadOnly Property NoProfileForRail As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoProfileForRail {
	FailureDefinitionId^ get ();
}
static member NoProfileForRail : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace